from config.buttons import btn

msg = {
    'msg1': {
        'text': '''Привет 😎 Жми ниже <b>"Начать"</b> и я
открою тебе доступ к приватной информации, которая поможет
зарабатывать на спортивных
ставках ⚽️ 💵''',
        'link': '',
        'inline': '',
        'buttons': [],
    },
    'msg2': {
        'text': '''😉 В следующем сообщении я пришлю <b>контент, которого нет в свободном доступе в сети</b>

Если ты просто хочешь приобрести наши прогнозы
Жми "купить прогноз" 👇🏻''',
        'link': '',
        'inline': '',
        'buttons':
            [
                btn['buy forecast'],
            ],
    },
    'msg3': {
        'text': '''
<b>Эту информацию не дают в бесплатных пабликах 🚷</b>

Полезные материалы, которые помогут удвоить твой игровой банк за вечер

link

❓ После просмотра видео ответьте нам всего на 3 вопроса, чтоб мы знали, как вам лучше помочь. <b>Жмите на кнопку "пройти опрос"</b>
''',
        'photo': [],
        'link': 'http://telegra.ph/Poleznye-materialy-kotorye-pomogut-udvoit-igrovoj-bank-za-vecher-07-02',
        'inline': [],
        'buttons':
            [
                btn['survey'],
            ],
    },
    'msg4': {
        'text': '''
<b>На что смотрят профи, прежде чем сделать победную ставку?</b>

link

❓После просмотра видео ответьте нам всего на 3 вопроса, чтоб мы знали, как вам лучше помочь. <b>Жмите на кнопку "пройти опрос"</b>
''',
        'link': 'http://telegra.ph/Kakuyu-statistiku-sobirayut-profi-chtoby-sdelat-vyigryshnuyu-stavku-07-02',
        'inline': [],
        'buttons':
            [
                btn['survey'],
            ],
    },
    'msg5': {
        'text': '''
Чтобы не проиграть свои деньги в начале игрового пути посмотрите видео, которое мы сделали для вас: 
<b>Ошибки, которые спустят ваш банк в трубу.</b>

link

❓После просмотра видео ответьте нам всего на 3 вопроса, чтоб мы знали, как вам лучше помочь. <b>Жмите на кнопку "пройти опрос"</b>
''',
        'link': 'http://telegra.ph/Oshibki-iz---za-kotoryh-vy-solyote-svoj-igrovoj-bank-v-pervuyu-nedelyu-Kratkoe-rukovodstvo-kak-dejstvovat-07-02',
        'inline': [],
        'buttons':
            [
                btn['survey'],
            ],
    },
    'msg6': {
        'text': '''Ответь мне всего на 3 вопроса, чтоб я знал, как тебе лучше помочь.
Жми на кнопку "Пройти опрос" 👇🏻''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['survey']
            ],
    },
    'msg7': {
        'text': '''
😎 Отлично! Ты посмотрел все видео, которые тебе помогут делать успешные ставки на спорт, но мы так и не получили  данные с опроса и не знаем твой текущий уровень знаний в ставках, чтобы дать максимально полезную информацию 😕
Пройдёшь опрос?
Жмите на кнопку ответа👇🏻''',
        'link': '',
        'inline': '',
        'buttons':
            [
                btn['yes'],
                btn['no'],
            ],
    },
    'msg9': {
        'text': '''😦 Мы не смогли вам помочь?
В поле ниже напишите пожалуйста, как мы можем улучшить наше следующее общение

Если больше не хотите получать новости от нас, то просто нажмите "Отписаться"''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['unsubscribe'],
            ],
    },
    'msg10': {
        'text': '''😎 Отлично! Вы посмотрели все видео, которые  помогут делать успешные ставки на спорт.
Давай продолжим?
Хочешь я расскажу, как заработать сегодня вечером 3000 рублей чистыми на одной ставке?

''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['yes'],
                btn['no'],
            ],
    },
    'msg11': {
        'text': '''😦 Мы не смогли вам помочь?
В поле ниже напишите пожалуйста, как мы можем улучшить наше следующее общение и нажмите "Продолжить"

Если больше не хотите получать новости от нас, то просто нажмите "Отписаться"''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['continue'],
                btn['unsubscribe'],
            ]
    },
    'msg12': {
        'text': '''
Вы делали ставки на спорт ранее ?''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['yes'],
                btn['no'],
            ],
    },
    'msg13': {
        'text': '''
Пользовались (пользуетесь) прогнозами на спорт?''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['yes'],
                btn['no'],
            ],
    },
    'msg14': {
        'text': '''Вы уже являетесь нашим клиентом?
    ''',
        'link': '',
        'inline': [],
        'buttons':
            [
                btn['yes'],
                btn['no'],
            ],
    },
    'msg15': {
        'text': '''😎 Спасибо, что уделил своё время и ответил на вопросы.
В ответ от нас держи видео, где мы расскажем как за один вечер можно заработать 3000 рублей чистыми на ставке.

link ''',
        'link': 'http://telegra.ph/Kak-za-odin-vecher-zarabotat-3000-r-07-02',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay'],
        ],
    },
    'msg16': {
        'text': '''
😎 Спасибо, что уделил своё время и ответил на вопросы

Две вещи, которые обязан знать каждый новичок:
1) Влейся в тусовку сильных игроков
2) Придерживайся своей стратегии при любом исходе. Не играй на эмоциях
Посмотри короткое видео, которое тебе раскроет базовые термины и как делать первые ставки 😉Жми "Посмотреть видео" Его нельзя пропускать!
"''',
        'link': '',
        'inline': [],
        'buttons': [
            btn['termins']
        ],
    },
    'msg17': {
        'text': '''Держи видео, где мы расскажем как за один вечер можно заработать 3000 рублей чистыми на ставке

link
''',
        'link': 'http://telegra.ph/Kak-za-odin-vecher-zarabotat-3000-r-07-02',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay']
        ],
    },
    'msg20': {
        'text': '''<b>VIP прогноз</b>
Это самый лучший прогноз на сегодня
Над ним работала вся команда проекта. Плюс сверху гарантия при не проходе ставки

Сумма к оплате: 1500
''',
        'link': '',
        'inline': '',
        'buttons': [
            btn['pay1500'],
        ],
    },
    'msg21': {
        'text': '''😎 Хей, бро
Посмотри нашу статистику по последним ставкам 🤑
Плюс если ставка не пройдёт- замену дадим бесплатно
Твой железный прогноз лежит в корзине, жми "оплатить"👇🏻''',
        'link': '',
        'inline': [],
        'buttons': [],
    },
    'msg22': {
        'text': '''❌ Осталось 3 места на этот прогноз!
Завтра будет поздно!
Скоро букмекеры закроют возможность ставить на этот матч, давай поднимем на нём бабки 😎
Жми "оплатить"👇🏻''',
        'link': '',
        'inline': [],
        'buttons': [],
    },
    'msg24': {
        'text': '''Thank you
Ваш прогноз уже ждёт вас!
Жмите "Перейти в месседжер"''',
        'link': '',
        'inline': [],
        'buttons': [],
    },
    'msg25': {
        'text': '''Thank you
Ваш прогноз уже ждёт вас!
Жмите "Перейти в месседжер"`''',
        'link': '',
        'inline': [],
        'buttons': [],
    },
    'msg26': {
        'text': '''😕 К сожалению сейчас нет активных прогнозов
Не беспокойтесь, ваши деньги в безопасности!
Завтра в обед, как только наша команда подготовим уверенные прогнозы, я пришлю его тебе😉
''',
        'link': '',
        'inline': [],
        'buttons': [],
    },
    'msg28': {
        'text': '''На что смотрят профи, прежде чем сделать победную ставку? 
        
link''',
        'link': 'http://telegra.ph/Kakuyu-statistiku-sobirayut-profi-chtoby-sdelat-vyigryshnuyu-stavku-07-02',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay']
        ],
    },
    'msg29': {
        'text': '''Коэффициент события уменьшается ближе к началу события.
Срочно нажмите "оплатить", чтоб пройти в оплату и увидеть прогноз 👇🏻
''',
        'link': '',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay']
        ],
    },
    'msg30': {
        'text': '''Чтобы не проиграть свои деньги в начале игрового пути посмотрите видео, которое мы сделали для вас: Ошибки, которые спустят ваш банк в трубу.

link
''',
        'link': 'http://telegra.ph/Oshibki-iz---za-kotoryh-vy-solyote-svoj-igrovoj-bank-v-pervuyu-nedelyu-Kratkoe-rukovodstvo-kak-dejstvovat-07-02-2',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay']
        ],
    },
    'msg31': {
        'text': '''Давайте мы возьмём все риски на себя! 😎
Гарантируем что если ставка не пройдёт - замену дадим бесплатно!

Жми "Оплатить" 👇🏻
''',
        'link': '',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay']
        ],
    },
    'msg32': {
        'text': '''Завтра будет поздно!
Пора действовать
Мы подготовили для тебя самый уверенный прогноз от всей команды и дали на него гарантию сверху 💵

Жми "Оплатить" 👇🏻
''',
        'link': '',
        'inline': [],
        'buttons': [
            btn['details'],
            btn['pay']
        ],
    },
    'msg_payment': {
        'text': '''<b>VIP прогноз</b>
Это самый лучший прогноз на сегодня
Над ним работала вся команда проекта. Плюс сверху гарантия при не проходе ставки

<b>Сумма к оплате: 1500 руб.</b>
''',
        'link': '',
        'inline': [],
        'buttons': [
            btn['pay1500'],
            btn['feedbacks'],
        ]
    },
    'msg_feedbacks': {
        'text': '''<b>Наши отзывы</b>
Эти люди уже убедились в нашей надёжности
Посмотри сам 

👉👉<a href="http://telegra.ph/Otzyvy-07-29-2">Смотреть отзывы</a>👈👈 
<b>Сумма к оплате: 1500 руб.</b>
''',
        'link': '',
        'inline': [],
        'buttons': [
            btn['pay1500']
        ]
    },
    'msg_not_ready': {
        'text': 'Карточка находится в разработке',
        'link': '',
        'inline': [],
        'buttons': ['/start'],
    },
    'msg_start_again': {
        'text': '''
Если ты просто хочешь приобрести наши прогнозы
Жми "купить прогноз" 👇🏻''',
        'link': '',
        'inline': '',
        'buttons':
            [
                btn['buy forecast'],
            ],
    },
}


